In [1]:
import pandas as pd
import numpy as np
import os
import scipy.stats as stats
# visualize
import seaborn as sns
import matplotlib.pyplot as plt

# turn off pink warning boxes
import warnings
warnings.filterwarnings("ignore")

#import my modules
import acquire as a
import prepare as p



# for preparation state
from sklearn.model_selection import train_test_split

from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier, plot_tree, export_text
from sklearn.dummy import DummyClassifier
from sklearn.metrics import classification_report

# Plan

# Acquire

In [2]:
df = pd.read_csv('df1_loan.csv')

In [3]:
df.head()

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Total_Income
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,$5849.0
1,1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,$6091.0
2,2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,$3000.0
3,3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,$4941.0
4,4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,$6000.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         500 non-null    int64
 1   Loan_ID            500 non-null    object
 2   Gender             491 non-null    object
 3   Married            497 non-null    object
 4   Dependents         488 non-null    object
 5   Education          500 non-null    object
 6   Self_Employed      473 non-null    object
 7   ApplicantIncome    500 non-null    int64
 8   CoapplicantIncome  500 non-null    float64
 9   LoanAmount         482 non-null    float64
 10  Loan_Amount_Term   486 non-null    float64
 11  Credit_History     459 non-null    float64
 12  Property_Area      500 non-null    object
 13  Loan_Status        500 non-null    object
 14  Total_Income       500 non-null    object
dtypes: float64(4), int64(2), object(9)
memory usage: 58.7+ KB

In [5]:
a.summarize(df)

=====================================================
Dataframe shape:
(500, 15)
=====================================================
Dataframe head:
   Unnamed: 0   Loan_ID Gender Married Dependents Education Self_Employed  \
0           0  LP001002   Male      No          0  Graduate            No
1           1  LP001003   Male     Yes          1  Graduate            No
2           2  LP001005   Male     Yes          0  Graduate           Yes

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
1             4583             1508.0       128.0             360.0
2             3000                0.0        66.0             360.0

   Credit_History Property_Area Loan_Status Total_Income
0             1.0         Urban           Y      $5849.0
1             1.0         Rural           N      $6091.0
2             1.0         Urban           Y      $3000.0
=====================================================
Dataframe info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         500 non-null    int64
 1   Loan_ID            500 non-null    object
 2   Gender             491 non-null    object
 3   Married            497 non-null    object
 4   Dependents         488 non-null    object
 5   Education          500 non-null    object
 6   Self_Employed      473 non-null    object
 7   ApplicantIncome    500 non-null    int64
 8   CoapplicantIncome  500 non-null    float64
 9   LoanAmount         482 non-null    float64
 10  Loan_Amount_Term   486 non-null    float64
 11  Credit_History     459 non-null    float64
 12  Property_Area      500 non-null    object
 13  Loan_Status        500 non-null    object
 14  Total_Income       500 non-null    object
dtypes: float64(4), int64(2), object(9)
memory usage: 58.7+ KB
None
=====================================================
Dataframe Description:
                   count         mean          std    min      25%     50%  \
Unnamed: 0         500.0   249.500000   144.481833    0.0   124.75   249.5
ApplicantIncome    500.0  5493.644000  6515.668972  150.0  2874.50  3854.0
CoapplicantIncome  500.0  1506.307840  2134.432188    0.0     0.00  1125.5
LoanAmount         482.0   144.020747    82.344919   17.0   100.00   126.5
Loan_Amount_Term   486.0   342.543210    63.834977   12.0   360.00   360.0
Credit_History     459.0     0.843137     0.364068    0.0     1.00     1.0

                       75%      max
Unnamed: 0          374.25    499.0
ApplicantIncome    5764.00  81000.0
CoapplicantIncome  2253.25  20000.0
LoanAmount          161.50    700.0
Loan_Amount_Term    360.00    480.0
Credit_History        1.00      1.0
=====================================================
**Unnamed: 0**
Unique Values :  500

(-0.5, 4.99]        5
(4.99, 9.98]        5
(9.98, 14.97]       5
(14.97, 19.96]      5
(19.96, 24.95]      5
                   ..
(474.05, 479.04]    5
(479.04, 484.03]    5
(484.03, 489.02]    5
(489.02, 494.01]    5
(494.01, 499.0]     5
Name: Unnamed: 0, Length: 100, dtype: int64
=====================================================
**Loan_ID**
Unique Values :  500

=====================================================
**Gender**
Unique Values :  2

Male      400
Female     91
Name: Gender, dtype: int64
=====================================================
**Married**
Unique Values :  2

Yes    322
No     175
Name: Married, dtype: int64
=====================================================
**Dependents**
Unique Values :  4

0     288
1      81
2      79
3+     40
Name: Dependents, dtype: int64
=====================================================
**Education**
Unique Values :  2

Graduate        393
Not Graduate    107
Name: Education, dtype: int64
=====================================================
**Self_Employed**
Unique Values :  2

No     407
Yes     66
Name: Self_Employed, dtype: int64
=====================================================
**ApplicantIncome**
Unique Values :  415

(69.149, 958.5]         3
(958.5, 1767.0]        11
(1767.0, 2575.5]       77
(2575.5, 3384.0]      104
(3384.0, 4192.5]       89
                     ...
(76957.5, 77766.0]      0
(77766.0, 78574.5]      0
(78574.5, 79383.0]      0
(79383.0, 80191.5]      0
(80191.5, 81000.0]      1
Name: ApplicantIncome, Length: 100, dtype: int64
=====================================================
**CoapplicantIncome**
Unique Values :  235

(-20.001, 200.0]      228
(200.0, 400.0]          0
(400.0, 600.0]          2
(600.0, 800.0]          6
(800.0, 1000.0]         6
                     ...
(19000.0, 19200.0]      0
(19200.0, 19400.0]      0
(19400.0, 19600.0]      0
(19600.0, 19800.0]      0
(19800.0, 20000.0]      2
Name: CoapplicantIncome, Length: 100, dtype: int64
=====================================================
**LoanAmount**
Unique Values :  179

(16.316, 23.83]     1
(23.83, 30.66]      4
(30.66, 37.49]      1
(37.49, 44.32]      3
(44.32, 51.15]      8
                   ..
(665.85, 672.68]    0
(672.68, 679.51]    0
(679.51, 686.34]    0
(686.34, 693.17]    0
(693.17, 700.0]     1
Name: LoanAmount, Length: 100, dtype: int64
=====================================================
**Loan_Amount_Term**
Unique Values :  10

12.0       1
36.0       1
60.0       2
84.0       2
120.0      3
180.0     35
240.0      3
300.0     12
360.0    415
480.0     12
Name: Loan_Amount_Term, dtype: int64
=====================================================
**Credit_History**
Unique Values :  2

0.0     72
1.0    387
Name: Credit_History, dtype: int64
=====================================================
**Property_Area**
Unique Values :  3

Semiurban    188
Urban        171
Rural        141
Name: Property_Area, dtype: int64
=====================================================
**Loan_Status**
Unique Values :  2

Y    345
N    155
Name: Loan_Status, dtype: int64
=====================================================
**Total_Income**
Unique Values :  457

=====================================================

**Takeaways**
- there are 14 columns ( I will dropp unamed column)
- there are null values
-Total_income should be numeric
- rename columns

# Prepare

In [6]:
df.columns

Index(['Unnamed: 0', 'Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status',
       'Total_Income'],
      dtype='object')

In [7]:
#drop unnamed column
df = df.drop(columns= ['Unnamed: 0'])

In [8]:
#rename columns (lowercase)
df.columns = map(str.lower, df.columns)

In [9]:
df.head()

,loan_id,gender,married,dependents,education,self_employed,applicantincome,coapplicantincome,loanamount,loan_amount_term,credit_history,property_area,loan_status,total_income
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,$5849.0
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,$6091.0
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,$3000.0
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,$4941.0
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,$6000.0

In [10]:
df.total_income.dtype

dtype('O')

In [11]:
# change type of total_income
#we need to remove $
df['total_income']= df.total_income.replace({'\$':''}, regex = True).astype('float')

In [12]:
df['total_income'].head(2)

0    5849.0
1    6091.0
Name: total_income, dtype: float64

In [13]:
df.dependents.value_counts()

0     288
1      81
2      79
3+     40
Name: dependents, dtype: int64

In [14]:
#change type in dependents
df['dependents']= df.dependents.replace({'\+':''}, regex = True).astype('float')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   loan_id            500 non-null    object
 1   gender             491 non-null    object
 2   married            497 non-null    object
 3   dependents         488 non-null    float64
 4   education          500 non-null    object
 5   self_employed      473 non-null    object
 6   applicantincome    500 non-null    int64
 7   coapplicantincome  500 non-null    float64
 8   loanamount         482 non-null    float64
 9   loan_amount_term   486 non-null    float64
 10  credit_history     459 non-null    float64
 11  property_area      500 non-null    object
 12  loan_status        500 non-null    object
 13  total_income       500 non-null    float64
dtypes: float64(6), int64(1), object(7)
memory usage: 54.8+ KB

In [16]:
#checking missing values
table = p.miss_dup_values(df)
table

Your selected dataframe has 14 columns.
There are 7 columns that have missing values.

** There are 0 duplicate rows that represents 0.0% of total Values**

                  Missing Values  % of Total Values
credit_history                41                8.2
self_employed                 27                5.4
loanamount                    18                3.6
loan_amount_term              14                2.8
dependents                    12                2.4
gender                         9                1.8
married                        3                0.6

In [17]:
for i in table.index:
    print(i)
    print(df[i].value_counts())
    print('----------------')

credit_history
1.0    387
0.0     72
Name: credit_history, dtype: int64
----------------
self_employed
No     407
Yes     66
Name: self_employed, dtype: int64
----------------
loanamount
120.0    19
160.0    12
110.0    12
100.0    11
128.0     9
         ..
330.0     1
304.0     1
192.0     1
280.0     1
700.0     1
Name: loanamount, Length: 179, dtype: int64
----------------
loan_amount_term
360.0    415
180.0     35
480.0     12
300.0     12
240.0      3
120.0      3
84.0       2
60.0       2
12.0       1
36.0       1
Name: loan_amount_term, dtype: int64
----------------
dependents
0.0    288
1.0     81
2.0     79
3.0     40
Name: dependents, dtype: int64
----------------
gender
Male      400
Female     91
Name: gender, dtype: int64
----------------
married
Yes    322
No     175
Name: married, dtype: int64
----------------

I will fill nulls values
- credit_history : 0
- self_employed :0
- dependents : 0
- gender : most common Male
- married :0
- loan_term : most common 360

In [18]:
#fill the columns with 0
df[['credit_history','self_employed','dependents', 'married']] =df[['credit_history','self_employed','dependents', 'married']].fillna(0)

In [19]:
#fill gender
df.gender.fillna('Male', inplace = True)

In [20]:
#fill loan_amount_term
df.loan_amount_term.fillna(360, inplace = True)

In [21]:
#fill loanamount
df.loanamount.describe()

count    482.000000
mean     144.020747
std       82.344919
min       17.000000
25%      100.000000
50%      126.500000
75%      161.500000
max      700.000000
Name: loanamount, dtype: float64

In [22]:
p.miss_dup_values(df)

Your selected dataframe has 14 columns.
There are 1 columns that have missing values.

** There are 0 duplicate rows that represents 0.0% of total Values**

            Missing Values  % of Total Values
loanamount              18                3.6

for this I'm going to use simple imputer after the split ( I will use mean)

In [23]:
## change the type od the columns

In [24]:
for i in df.columns:
    print(i)
    print(df[i].value_counts())
    print('----------------')

loan_id
LP001100    1
LP002319    1
LP002287    1
LP001264    1
LP001798    1
           ..
LP002008    1
LP002188    1
LP001854    1
LP001647    1
LP002144    1
Name: loan_id, Length: 500, dtype: int64
----------------
gender
Male      409
Female     91
Name: gender, dtype: int64
----------------
married
Yes    322
No     175
0        3
Name: married, dtype: int64
----------------
dependents
0.0    300
1.0     81
2.0     79
3.0     40
Name: dependents, dtype: int64
----------------
education
Graduate        393
Not Graduate    107
Name: education, dtype: int64
----------------
self_employed
No     407
Yes     66
0       27
Name: self_employed, dtype: int64
----------------
applicantincome
2500    8
2600    6
4166    5
4583    5
3750    5
       ..
5821    1
2750    1
2755    1
5829    1
3691    1
Name: applicantincome, Length: 415, dtype: int64
----------------
coapplicantincome
0.0       226
1666.0      5
2083.0      5
5625.0      3
1459.0      3
         ...
1964.0      1
983.0       1
830.0       1
1447.0      1
7250.0      1
Name: coapplicantincome, Length: 235, dtype: int64
----------------
loanamount
120.0    19
160.0    12
110.0    12
100.0    11
128.0     9
         ..
330.0     1
304.0     1
192.0     1
280.0     1
700.0     1
Name: loanamount, Length: 179, dtype: int64
----------------
loan_amount_term
360.0    429
180.0     35
480.0     12
300.0     12
240.0      3
120.0      3
84.0       2
60.0       2
12.0       1
36.0       1
Name: loan_amount_term, dtype: int64
----------------
credit_history
1.0    387
0.0    113
Name: credit_history, dtype: int64
----------------
property_area
Semiurban    188
Urban        171
Rural        141
Name: property_area, dtype: int64
----------------
loan_status
Y    345
N    155
Name: loan_status, dtype: int64
----------------
total_income
3750.0    4
6000.0    4
6277.0    3
4583.0    3
4166.0    3
         ..
2889.0    1
5251.0    1
7542.0    1
5386.0    1
3000.0    1
Name: total_income, Length: 457, dtype: int64
----------------

In [25]:
# encode yes/no columns : loan_status, self_employed, married
df[['loan_status', 'self_employed', 'married']] = df[['loan_status', 'self_employed', 'married']].replace({'Yes': 1, 'No': 0, 'Y': 1, 'N': 0})

In [26]:
#encode gender female = 0 , male = 1
df.gender.replace({'Male': 1, 'Female': 0}, inplace = True)

In [27]:
for i in df.drop(columns = 'loan_id') .columns:
    print(i)
    print(df[i].value_counts())
    print('----------------')

gender
1    409
0     91
Name: gender, dtype: int64
----------------
married
1    322
0    178
Name: married, dtype: int64
----------------
dependents
0.0    300
1.0     81
2.0     79
3.0     40
Name: dependents, dtype: int64
----------------
education
Graduate        393
Not Graduate    107
Name: education, dtype: int64
----------------
self_employed
0    434
1     66
Name: self_employed, dtype: int64
----------------
applicantincome
2500    8
2600    6
4166    5
4583    5
3750    5
       ..
5821    1
2750    1
2755    1
5829    1
3691    1
Name: applicantincome, Length: 415, dtype: int64
----------------
coapplicantincome
0.0       226
1666.0      5
2083.0      5
5625.0      3
1459.0      3
         ...
1964.0      1
983.0       1
830.0       1
1447.0      1
7250.0      1
Name: coapplicantincome, Length: 235, dtype: int64
----------------
loanamount
120.0    19
160.0    12
110.0    12
100.0    11
128.0     9
         ..
330.0     1
304.0     1
192.0     1
280.0     1
700.0     1
Name: loanamount, Length: 179, dtype: int64
----------------
loan_amount_term
360.0    429
180.0     35
480.0     12
300.0     12
240.0      3
120.0      3
84.0       2
60.0       2
12.0       1
36.0       1
Name: loan_amount_term, dtype: int64
----------------
credit_history
1.0    387
0.0    113
Name: credit_history, dtype: int64
----------------
property_area
Semiurban    188
Urban        171
Rural        141
Name: property_area, dtype: int64
----------------
loan_status
1    345
0    155
Name: loan_status, dtype: int64
----------------
total_income
3750.0    4
6000.0    4
6277.0    3
4583.0    3
4166.0    3
         ..
2889.0    1
5251.0    1
7542.0    1
5386.0    1
3000.0    1
Name: total_income, Length: 457, dtype: int64
----------------

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   loan_id            500 non-null    object
 1   gender             500 non-null    int64
 2   married            500 non-null    int64
 3   dependents         500 non-null    float64
 4   education          500 non-null    object
 5   self_employed      500 non-null    int64
 6   applicantincome    500 non-null    int64
 7   coapplicantincome  500 non-null    float64
 8   loanamount         482 non-null    float64
 9   loan_amount_term   500 non-null    float64
 10  credit_history     500 non-null    float64
 11  property_area      500 non-null    object
 12  loan_status        500 non-null    int64
 13  total_income       500 non-null    float64
dtypes: float64(6), int64(5), object(3)
memory usage: 54.8+ KB

In [29]:
#create dummies

In [30]:
dummy_df = pd.get_dummies(df[['education','property_area']])

In [31]:
dummy_df.head()

,education_Graduate,education_Not Graduate,property_area_Rural,property_area_Semiurban,property_area_Urban
0,1,0,0,0,1
1,1,0,1,0,0
2,1,0,0,0,1
3,0,1,0,0,1
4,1,0,0,0,1

In [32]:
#lowercase the columns
dummy_df.columns = map(str.lower, dummy_df.columns)

In [33]:
#concat 2dfs
df = pd.concat([df, dummy_df], axis=1).drop(columns = ['education', 'property_area','education_not graduate'])

In [34]:
df.columns

Index(['loan_id', 'gender', 'married', 'dependents', 'self_employed',
       'applicantincome', 'coapplicantincome', 'loanamount',
       'loan_amount_term', 'credit_history', 'loan_status', 'total_income',
       'education_graduate', 'property_area_rural', 'property_area_semiurban',
       'property_area_urban'],
      dtype='object')

Prepare :
- drop unnamed column
- rename columns(lowercase)
- remove $ and change type of total_income
- remove + and change type for dependents
    0 = no dependents
    1 = 1 dependents
    2 =  two dependents
    3 = three or more dependets
- fill nulls values

    - credit_history : 0
    - self_employed :0
    - dependents : 0
    - gender : most common Male
    - married :0
    - loan_term : most common 360
- encode loan_status, self_employed, married, gender
- create dummy  ('education', 'property_area) , drop 'education', 'property_area','education_not graduate']

In [35]:
df.head()

,loan_id,gender,married,dependents,self_employed,applicantincome,coapplicantincome,loanamount,loan_amount_term,credit_history,loan_status,total_income,education_graduate,property_area_rural,property_area_semiurban,property_area_urban
0,LP001002,1,0,0.0,0,5849,0.0,NaN,360.0,1.0,1,5849.0,1,0,0,1
1,LP001003,1,1,1.0,0,4583,1508.0,128.0,360.0,1.0,0,6091.0,1,1,0,0
2,LP001005,1,1,0.0,1,3000,0.0,66.0,360.0,1.0,1,3000.0,1,0,0,1
3,LP001006,1,1,0.0,0,2583,2358.0,120.0,360.0,1.0,1,4941.0,0,0,0,1
4,LP001008,1,0,0.0,0,6000,0.0,141.0,360.0,1.0,1,6000.0,1,0,0,1

In [36]:
#split

In [37]:
train, validate, test = p.split_data(df, 'loan_status')

complete df -> (500, 16)
train -> (280, 16)
validate -> (120, 16)
test -> (100, 16)

In [ ]:
def impute_mode(train, validate, test):
    '''
    take in train, validate, and test DataFrames, impute mode for 'loanamount',
    and return train, validate, and test DataFrames
    '''
    imputer = SimpleImputer(missing_values = None, strategy='mean')
    train[['loanamount']] = imputer.fit_transform(train[['loanamount']])
    validate[['loanamount']] = imputer.transform(validate[['loanamount']])
    test[['loanamount']] = imputer.transform(test[['loanamount']])
    return train, validate, test